In [2]:
# с 305 страницы книги
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.362575  0.991041
1    a  two  0.932341 -1.222821
2    b  one  0.485386 -0.619984
3    b  two  0.162999  0.265069
4    a  one -2.006070  0.511615

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped.mean()

key1
a   -0.237051
b    0.324192
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [7]:
means

key1  key2
a     one    -0.821747
      two     0.932341
b     one     0.485386
      two     0.162999
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -0.821747  0.932341
b     0.485386  0.162999

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005    0.932341
            2006    0.485386
Ohio        2005    0.262787
            2006   -2.006070
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean(numeric_only=True)

         data1     data2
key1
a    -0.237051  0.093279
b     0.324192 -0.177457

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.821747  0.751328
     two   0.932341 -1.222821
b    one   0.485386 -0.619984
     two   0.162999  0.265069

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.362575  0.991041
1    a  two  0.932341 -1.222821
4    a  one -2.006070  0.511615
b
  key1 key2     data1     data2
2    b  one  0.485386 -0.619984
3    b  two  0.162999  0.265069

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  0.362575  0.991041
4    a  one -2.006070  0.511615
a two
  key1 key2     data1     data2
1    a  two  0.932341 -1.222821
b one
  key1 key2     data1     data2
2    b  one  0.485386 -0.619984
b two
  key1 key2     data1     data2
3    b  two  0.162999  0.265069

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.485386 -0.619984
3    b  two  0.162999  0.265069

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1) # группировка по dtype

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_5436\1415930929.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby(df.dtypes, axis=1) # группировка по dtype

In [22]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.362575  0.991041
1  0.932341 -1.222821
2  0.485386 -0.619984
3  0.162999  0.265069
4 -2.006070  0.511615
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [23]:
df.groupby('key1')['data1'] # синтаксический сахар для df['data1'].groupby(df['key1'])

In [24]:
df.groupby('key1')[['data2']] # для df[['data2']].groupby(df['key1'])

In [25]:
df.groupby(['key1', 'key2'])[['data2']].mean() # среднее только по data2

              data2
key1 key2
a    one   0.751328
     two  -1.222821
b    one  -0.619984
     two   0.265069

In [26]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [27]:
s_grouped.mean()

key1  key2
a     one     0.751328
      two    -1.222821
b     one    -0.619984
      two     0.265069
Name: data2, dtype: float64

In [28]:
people = pd.DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [29]:
people.iloc[[2], [1, 2]]= np.nan # в книге было people.ix[2:3, ['b', 'c']] = np.nan но ix устарело

In [30]:
people

               a         b         c         d         e
Joe    -1.435924 -0.386237 -0.166814  0.039467 -0.083768
Steve  -0.395580  0.529488 -2.290443 -1.307262  0.138535
Wes     0.953097       NaN       NaN  0.462906 -0.661462
Jim    -0.996759  0.919836 -1.006397 -1.987551  2.238209
Travis  0.794389  2.033231  0.918271 -0.862264 -0.895168

In [31]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'} # соответствие между столбцами и группами

In [32]:
by_column = people.groupby(mapping, axis=1)

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_5436\3111365124.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [33]:
by_column.sum()

            blue       red
Joe    -0.127347 -1.905930
Steve  -3.597704  0.272444
Wes     0.462906  0.291635
Jim    -2.993949  2.161286
Travis  0.056007  1.932451

In [34]:
map_series = pd.Series(mapping)

In [35]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [36]:
people.groupby(map_series, axis=1).count()

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_5436\1833935060.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [37]:
people.groupby(len).sum() # группировка по длине имени

          a         b         c         d         e
3 -1.479586  0.533598 -1.173211 -1.485178  1.492978
5 -0.395580  0.529488 -2.290443 -1.307262  0.138535
6  0.794389  2.033231  0.918271 -0.862264 -0.895168

In [38]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [39]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.435924 -0.386237 -0.166814  0.039467 -0.661462
  two -0.996759  0.919836 -1.006397 -1.987551  2.238209
5 one -0.395580  0.529488 -2.290443 -1.307262  0.138535
6 two  0.794389  2.033231  0.918271 -0.862264 -0.895168

In [40]:
people

               a         b         c         d         e
Joe    -1.435924 -0.386237 -0.166814  0.039467 -0.083768
Steve  -0.395580  0.529488 -2.290443 -1.307262  0.138535
Wes     0.953097       NaN       NaN  0.462906 -0.661462
Jim    -0.996759  0.919836 -1.006397 -1.987551  2.238209
Travis  0.794389  2.033231  0.918271 -0.862264 -0.895168

In [41]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [42]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.472310 -0.279843  2.206168 -1.150026 -0.356430
1     -0.755487 -0.805743  0.421937  0.601872  1.331968
2      1.283706 -0.567795 -0.614966 -0.044456 -0.634783
3      0.878267  0.023712 -0.775434  1.753159 -1.184037

In [31]:
hier_df.groupby(level='cty', axis=1).count()

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_10232\2333815484.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [44]:
df

  key1 key2     data1     data2
0    a  one  0.362575  0.991041
1    a  two  0.932341 -1.222821
2    b  one  0.485386 -0.619984
3    b  two  0.162999  0.265069
4    a  one -2.006070  0.511615

In [45]:
grouped = df.groupby('key1')

In [46]:
grouped['data1'].quantile(0.9)

key1
a    0.818388
b    0.453147
Name: data1, dtype: float64

In [47]:
def peak_to_peak(arr):
    return (arr.max() - arr.min())

In [48]:
grouped[["data1", "data2"]].agg(peak_to_peak) # должно быть grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.938411  2.213862
b     0.322387  0.885054

In [49]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.237051  1.558277 -2.006070 -0.821747  0.362575  0.647458
b      2.0  0.324192  0.227962  0.162999  0.243596  0.324192  0.404789

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.932341   3.0  0.093279  1.164710 -1.222821 -0.355603  0.511615
b     0.485386   2.0 -0.177457  0.625827 -0.619984 -0.398721 -0.177457


           75%       max
key1
a     0.751328  0.991041
b     0.043806  0.265069

In [50]:
tips = pd.read_csv('examples/tips.csv')

In [51]:
# Добавить величину чаевых в виде процента от суммы счета
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [52]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [53]:
grouped = tips.groupby(['day', 'smoker'])

In [54]:
grouped_pct = grouped['tip_pct']

In [55]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [56]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [57]:
grouped_pct

In [58]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)]) # группировка с применением функций с заданием колонок

C:\Users\anton.dmitriev\AppData\Local\Temp\ipykernel_5436\1373227649.py:1: FutureWarning: The provided callable <function std at 0x0000028D29BF04A0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([('foo', 'mean'), ('bar', np.std)]) # группировка с применением функций с заданием колонок

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [59]:
functions = ['count', 'mean', 'max', peak_to_peak] # список функций

In [60]:
result = grouped[['tip_pct', 'total_bill']].agg(functions) # в книге квадратные скобки 1 раз

In [61]:
result

            tip_pct                                  total_bill             \
              count      mean       max peak_to_peak      count       mean
day  smoker
Fri  No           4  0.151650  0.187735     0.067349          4  18.420000
     Yes         15  0.174783  0.263480     0.159925         15  16.813333
Sat  No          45  0.158048  0.291990     0.235193         45  19.661778
     Yes         42  0.147906  0.325733     0.290095         42  21.276667
Sun  No          57  0.160113  0.252672     0.193226         57  20.506667
     Yes         19  0.187250  0.710345     0.644685         19  24.120000
Thur No          45  0.160298  0.266312     0.193350         45  17.113111
     Yes         17  0.163863  0.241255     0.151240         17  19.190588


               max peak_to_peak
day  smoker
Fri  No      22.75        10.29
     Yes     40.17        34.42
Sat  No      48.33        41.08
     Yes     50.81        47.74
Sun  No      48.17        39.40
     Yes     45.35        38.10
Thur No      41.19        33.68
     Yes     43.11        32.77

In [62]:
result['tip_pct']

             count      mean       max  peak_to_peak
day  smoker
Fri  No          4  0.151650  0.187735      0.067349
     Yes        15  0.174783  0.263480      0.159925
Sat  No         45  0.158048  0.291990      0.235193
     Yes        42  0.147906  0.325733      0.290095
Sun  No         57  0.160113  0.252672      0.193226
     Yes        19  0.187250  0.710345      0.644685
Thur No         45  0.160298  0.266312      0.193350
     Yes        17  0.163863  0.241255      0.151240

In [63]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', 'var')] # в книге np.var

In [64]:
grouped[['tip_pct', 'total_bill']].agg(ftuples) # в книге одинарные скодки

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [65]:
grouped.agg({'tip' : 'max', 'size' : 'sum'}) # имена столбцов + функции было np.max

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [66]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [67]:
tips.groupby(['day', 'smoker'], as_index=False).mean(numeric_only=True) # numeric_only = True не было в книге

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [68]:
def top(df, n=5, column='tip_pct'):
    return df.sort_index(axis=1)[-n:] # в книге было df.sort_index(by=column)[–n:]

In [69]:
top(tips, n=6)

      day  size smoker    time   tip   tip_pct  total_bill
238   Sat     3     No  Dinner  4.67  0.130338       35.83
239   Sat     3     No  Dinner  5.92  0.203927       29.03
240   Sat     2    Yes  Dinner  2.00  0.073584       27.18
241   Sat     2    Yes  Dinner  2.00  0.088222       22.67
242   Sat     2     No  Dinner  1.75  0.098204       17.82
243  Thur     2     No  Dinner  3.00  0.159744       18.78

In [58]:
tips.groupby('smoker').apply(top) # группировка по 'smoker' применяем функциою top

             day  size smoker    time   tip   tip_pct  total_bill
smoker
No     235   Sat     2     No  Dinner  1.25  0.124131       10.07
       238   Sat     3     No  Dinner  4.67  0.130338       35.83
       239   Sat     3     No  Dinner  5.92  0.203927       29.03
       242   Sat     2     No  Dinner  1.75  0.098204       17.82
       243  Thur     2     No  Dinner  3.00  0.159744       18.78
Yes    234   Sat     2    Yes  Dinner  3.00  0.193175       15.53
       236   Sat     2    Yes  Dinner  1.00  0.079365       12.60
       237   Sat     2    Yes  Dinner  1.17  0.035638       32.83
       240   Sat     2    Yes  Dinner  2.00  0.073584       27.18
       241   Sat     2    Yes  Dinner  2.00  0.088222       22.67

In [70]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill') # передача аргументов в функциою apply

                  day  size smoker    time   tip   tip_pct  total_bill
smoker day
No     Fri  223   Fri     3     No   Lunch  3.00  0.187735       15.98
       Sat  242   Sat     2     No  Dinner  1.75  0.098204       17.82
       Sun  185   Sun     5     No  Dinner  5.00  0.241663       20.69
       Thur 243  Thur     2     No  Dinner  3.00  0.159744       18.78
Yes    Fri  226   Fri     2    Yes   Lunch  2.00  0.198216       10.09
       Sat  241   Sat     2    Yes  Dinner  2.00  0.088222       22.67
       Sun  190   Sun     2    Yes  Dinner  1.50  0.095602       15.69
       Thur 205  Thur     3    Yes   Lunch  3.23  0.196114       16.47

In [71]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [61]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [72]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [73]:
tips.groupby('smoker', group_keys=False).apply(top) # подавление ключей

      day  size smoker    time   tip   tip_pct  total_bill
235   Sat     2     No  Dinner  1.25  0.124131       10.07
238   Sat     3     No  Dinner  4.67  0.130338       35.83
239   Sat     3     No  Dinner  5.92  0.203927       29.03
242   Sat     2     No  Dinner  1.75  0.098204       17.82
243  Thur     2     No  Dinner  3.00  0.159744       18.78
234   Sat     2    Yes  Dinner  3.00  0.193175       15.53
236   Sat     2    Yes  Dinner  1.00  0.079365       12.60
237   Sat     2    Yes  Dinner  1.17  0.035638       32.83
240   Sat     2    Yes  Dinner  2.00  0.073584       27.18
241   Sat     2    Yes  Dinner  2.00  0.088222       22.67

In [74]:
frame = pd.DataFrame({'data1': np.random.randn(1000),'data2': np.random.randn(1000)})

In [75]:
quartiles = pd.cut(frame.data1, 4) # разбиение на квантили

In [76]:
quartiles[:10]

0     (-0.151, 1.657]
1    (-1.958, -0.151]
2    (-1.958, -0.151]
3    (-1.958, -0.151]
4    (-1.958, -0.151]
5     (-0.151, 1.657]
6     (-0.151, 1.657]
7     (-0.151, 1.657]
8     (-0.151, 1.657]
9    (-1.958, -0.151]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.773, -1.958] < (-1.958, -0.151] < (-0.151, 1.657] < (1.657, 3.465]]

In [77]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),'count': group.count(), 'mean': group.mean()}

In [79]:
grouped = frame.data2.groupby(factor) # страница 323

NameError: name 'factor' is not defined

In [81]:
frame.data2

0     -1.698649
1      0.859158
2      1.255958
3      0.765507
4      1.060680
         ...
995   -1.929608
996    1.629888
997   -1.020988
998   -0.730775
999    1.897513
Name: data2, Length: 1000, dtype: float64

In [82]:
# Вернуть номера квантилей
grouping = pd.qcut(frame.data1, 10, labels=False)

In [83]:
grouped = frame.data2.groupby(grouping)

In [84]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.625782  2.562865  100.0  0.043572
1     -2.702333  2.593620  100.0 -0.077662
2     -1.906222  2.727938  100.0 -0.045224
3     -2.303563  2.082592  100.0 -0.009884
4     -2.380703  1.985566  100.0 -0.086787
5     -2.725239  2.823827  100.0 -0.011305
6     -2.100561  2.311856  100.0 -0.003680
7     -1.910954  2.192793  100.0 -0.034038
8     -2.032396  2.945562  100.0 -0.095474
9     -3.004399  2.114366  100.0 -0.064325

In [87]:
s = pd.Series(np.random.randn(6))

In [88]:
s[::2] = np.nan

In [89]:
s

0         NaN
1    0.383207
2         NaN
3    0.549898
4         NaN
5   -1.289116
dtype: float64

In [90]:
s.fillna(s.mean()) # подстановка зависящих от группы значений вместо отсутствующих

0   -0.118670
1    0.383207
2   -0.118670
3    0.549898
4   -0.118670
5   -1.289116
dtype: float64

In [91]:
states = ['Ohio', 'New York', 'Vermont', 'Florida','Oregon', 'Nevada', 'California', 'Idaho']

In [92]:
group_key = ['East'] * 4 + ['West'] * 4

In [93]:
data = pd.Series(np.random.randn(8), index=states)

In [94]:
data

Ohio         -1.879360
New York     -1.249141
Vermont       0.183768
Florida      -1.464175
Oregon        0.685786
Nevada        0.390844
California   -1.489997
Idaho         2.145365
dtype: float64

In [95]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [96]:
data

Ohio         -1.879360
New York     -1.249141
Vermont            NaN
Florida      -1.464175
Oregon        0.685786
Nevada             NaN
California   -1.489997
Idaho              NaN
dtype: float64

In [97]:
data.groupby(group_key).mean()

East   -1.530892
West   -0.402105
dtype: float64

In [98]:
# Чтобы подставить вместо отсутствующих значений групповые средние,нужно поступить так:
fill_mean = lambda g: g.fillna(g.mean())

In [99]:
data.groupby(group_key).apply(fill_mean)

East  Ohio         -1.879360
      New York     -1.249141
      Vermont      -1.530892
      Florida      -1.464175
West  Oregon        0.685786
      Nevada       -0.402105
      California   -1.489997
      Idaho        -0.402105
dtype: float64

In [101]:
# Если нужно подставить вместо отсутствующих значений фиксированные, но зависящие от группы
fill_values = {'East': 0.5, 'West': -1}

In [102]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [103]:
data.groupby(group_key).apply(fill_func)

East  Ohio         -1.879360
      New York     -1.249141
      Vermont       0.500000
      Florida      -1.464175
West  Oregon        0.685786
      Nevada       -1.000000
      California   -1.489997
      Idaho        -1.000000
dtype: float64

In [105]:
# Hearts (черви), Spades (пики), Clubs (трефы), Diamonds (бубны)
suits = ['H', 'S', 'C', 'D']

In [113]:
card_val = (list(range(1, 11)) + [10] * 3) * 4 # в книге range не был обернут в список и была ошибка

In [114]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

In [116]:
deck = pd.Series(card_val, index=cards) #

In [117]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [118]:
# сдать 5 карт
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

In [119]:
draw(deck)

10C    10
7S      7
KH     10
JS     10
4D      4
dtype: int64

In [123]:
# Пусть требуется выбрать по две случайные карты каждой масти
get_suit = lambda card: card[-1] # последняя буква обозначает масть

In [124]:
deck.groupby(get_suit).apply(draw, n=2)

C  2C     2
   QC    10
D  5D     5
   2D     2
H  6H     6
   3H     3
S  8S     8
   JS    10
dtype: int64

In [125]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

6C      6
7C      7
10D    10
KD     10
4H      4
6H      6
7S      7
QS     10
dtype: int64

In [128]:
# групповое взвешенное среднее и корреляция
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                'data': np.random.randn(8),
                'weights': np.random.rand(8)})

In [129]:
df

  category      data   weights
0        a -0.956022  0.107508
1        a -1.056125  0.255586
2        a  1.755899  0.418341
3        a -1.643221  0.351963
4        b -0.512912  0.564738
5        b -0.547371  0.131935
6        b  0.245681  0.102512
7        b -0.358642  0.645409

In [130]:
# Групповое взвешенное среднее по столбцу category
grouped = df.groupby('category')

In [131]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [132]:
grouped.apply(get_wavg)

category
a   -0.191018
b   -0.393304
dtype: float64

In [134]:
close_px = pd.read_csv('examples/stock_px.csv', parse_dates=True,index_col=0)

In [135]:
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
...            ...    ...    ...      ...
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [136]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [137]:
# вычислить объект DataFrame, содержащий годовые корреляции между суточной доходностью (вычисленной по процентному из- менению) и SPX
spx_corr = lambda x: x.corrwith(x['SPX'])

In [138]:
# Затем вычислим процентное изменение в close_px с помощью метода pct_change:
rets = close_px.pct_change().dropna()

In [139]:
# И наконец, сгруппируем процентные изменения по годам, которые можноизвлечь из метки строки однострочной функцией, возвращающей атрибутyear метки datetime:
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [140]:
# годовая корреляцию между Apple и Microsoft
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [141]:
import statsmodels.api as sm

In [143]:
# вычисляет регрессию обычным методом наименьших квадратов для каждого блока данных
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [144]:
# линейной регрессии AAPL от суточного оборота SPX по годам
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [146]:
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [147]:
tips.pivot_table(index=['day', 'smoker']) # как в книге не работает.

TypeError: agg function failed [how->mean,dtype->object]

In [148]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],columns='smoker') # 332

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863